nxp-appcodehub/dm-lvgl-epaper-smartlabel-kw45/k32w148evk_wireless_uart_epaper_freertos/startup/startup_k32w148.c
    // Load base address of Global Section Table
    SectionTableAddr = &__data_section_table;

    // Copy the data sections from flash to SRAM.
    while (SectionTableAddr < &__data_section_table_end) {
        LoadAddr = *SectionTableAddr++;
        ExeAddr = *SectionTableAddr++;
        SectionLen = *SectionTableAddr++;
        data_init(LoadAddr, ExeAddr, SectionLen);
    }

    // At this point, SectionTableAddr = &__bss_section_table;
    // Zero fill the bss segment
    while (SectionTableAddr < &__bss_section_table_end) {
        ExeAddr = *SectionTableAddr++;
        SectionLen = *SectionTableAddr++;
        bss_init(ExeAddr, SectionLen);
    }

#if !defined (__USE_CMSIS)
// Assume that if __USE_CMSIS defined, then CMSIS SystemInit code
// will setup the VTOR register

    // Check to see if we are running the code from a non-zero
    // address (eg RAM, external flash), in which case we need
    // to modify the VTOR register to tell the CPU that the
    // vector table is located at a non-0x0 address.
    unsigned int * pSCB_VTOR = (unsigned int *) 0xE000ED08;
    if ((unsigned int *)g_pfnVectors!=(unsigned int *) 0x00000000) {
        *pSCB_VTOR = (unsigned int)g_pfnVectors;
    }
#endif // (__USE_CMSIS)
#if defined (__cplusplus)
    //
    // Call C++ library initialisation
    //
    __libc_init_array();
#endif

    // Reenable interrupts
    __asm volatile ("cpsie i");

#if defined (__REDLIB__)
    // Call the Redlib library, which in turn calls main()
    __main();
#else
    main();
#endif

    //
    // main() shouldn't return, but if it does, we'll just enter an infinite loop
    //
    while (1) {
        ;
    }
}

//*****************************************************************************
// Default core exception handlers. Override the ones here by defining your own
// handler routines in your application code.
//*****************************************************************************
WEAK_AV void NMI_Handler(void)
{ while(1) {}
}

WEAK_AV void HardFault_Handler(void)
{ while(1) {}
}

WEAK_AV void MemManage_Handler(void)
{ while(1) {}
}

WEAK_AV void BusFault_Handler(void)
{ while(1) {}
}

WEAK_AV void UsageFault_Handler(void)
{ while(1) {}
}

WEAK_AV void SecureFault_Handler(void)
{ while(1) {}
}

WEAK_AV void SVC_Handler(void)
{ while(1) {}
}

WEAK_AV void DebugMon_Handler(void)
{ while(1) {}
}

WEAK_AV void PendSV_Handler(void)
{ while(1) {}
}

WEAK_AV void SysTick_Handler(void)
{ while(1) {}
}

//*****************************************************************************
// Processor ends up here if an unexpected interrupt occurs or a specific
// handler is not present in the application code.
//*****************************************************************************
WEAK_AV void IntDefaultHandler(void)
{ while(1) {}
}

//*****************************************************************************
// Default application exception handlers. Override the ones here by defining
// your own handler routines in your application code. These routines call
// driver exception handlers or IntDefaultHandler() if no driver exception
// handler is included.
//*****************************************************************************
WEAK void CTI_IRQHandler(void)
{   CTI_DriverIRQHandler();
}

WEAK void CMC0_IRQHandler(void)
{   CMC0_DriverIRQHandler();
}

WEAK void DMA0_CH0_IRQHandler(void)
{   DMA0_DriverIRQHandler();
}

WEAK void DMA0_CH1_IRQHandler(void)
{   DMA0_DriverIRQHandler();
}

WEAK void DMA0_CH2_IRQHandler(void)
{   DMA0_DriverIRQHandler();
}

WEAK void DMA0_CH3_IRQHandler(void)
{   DMA0_DriverIRQHandler();
}

WEAK void DMA0_CH4_IRQHandler(void)
{   DMA0_DriverIRQHandler();
}

WEAK void DMA0_CH5_IRQHandler(void)
{   DMA0_DriverIRQHandler();
}

WEAK void DMA0_CH6_IRQHandler(void)
{   DMA0_DriverIRQHandler();
}

WEAK void DMA0_CH7_IRQHandler(void)
{   DMA0_DriverIRQHandler();
}

WEAK void DMA0_CH8_IRQHandler(void)
{   DMA0_DriverIRQHandler();
}

WEAK void DMA0_CH9_IRQHandler(void)
{   DMA0_DriverIRQHandler();
}

WEAK void DMA0_CH10_IRQHandler(void)
{   DMA0_DriverIRQHandler();
}

WEAK void DMA0_CH11_IRQHandler(void)
{   DMA0_DriverIRQHandler();
}

WEAK void DMA0_CH12_IRQHandler(void)
{   DMA0_DriverIRQHandler();
}

WEAK void DMA0_CH13_IRQHandler(void)
{   DMA0_DriverIRQHandler();
}

WEAK void DMA0_CH14_IRQHandler(void)
{   DMA0_DriverIRQHandler();
}

WEAK void DMA0_CH15_IRQHandler(void)
{   DMA0_DriverIRQHandler();
}

WEAK void EWM0_IRQHandler(void)
{   EWM0_DriverIRQHandler();
}

WEAK void MCM0_IRQHandler(void)
{   MCM0_DriverIRQHandler();
}

WEAK void MSCM0_IRQHandler(void)
{   MSCM0_DriverIRQHandler();
}

WEAK void SPC0_IRQHandler(void)
{   SPC0_DriverIRQHandler();
}

WEAK void WUU0_IRQHandler(void)
{   WUU0_DriverIRQHandler();
}

WEAK void WDOG0_IRQHandler(void)
{   WDOG0_DriverIRQHandler();
}

WEAK void WDOG1_IRQHandler(void)
{   WDOG1_DriverIRQHandler();
}

WEAK void SCG0_IRQHandler(void)
{   SCG0_DriverIRQHandler();
}

WEAK void SFA0_IRQHandler(void)
{   SFA0_DriverIRQHandler();
}

WEAK void FMU0_IRQHandler(void)
{   FMU0_DriverIRQHandler();
}

WEAK void ELE_CMD_IRQHandler(void)
{   ELE_CMD_DriverIRQHandler();
}

WEAK void ELE_SECURE_IRQHandler(void)
{   ELE_SECURE_DriverIRQHandler();
}

WEAK void ELE_NONSECURE_IRQHandler(void)
{   ELE_NONSECURE_DriverIRQHandler();
}

WEAK void TRDC0_IRQHandler(void)
{   TRDC0_DriverIRQHandler();
}

WEAK void RTC_Alarm_IRQHandler(void)
{   RTC_Alarm_DriverIRQHandler();
}

WEAK void RTC_Seconds_IRQHandler(void)
{   RTC_Seconds_DriverIRQHandler();
}

WEAK void LPTMR0_IRQHandler(void)
{   LPTMR0_DriverIRQHandler();
}

WEAK void LPTMR1_IRQHandler(void)
{   LPTMR1_DriverIRQHandler();
}

WEAK void LPIT0_IRQHandler(void)
{   LPIT0_DriverIRQHandler();
}

WEAK void TPM0_IRQHandler(void)
{   TPM0_DriverIRQHandler();
}

WEAK void TPM1_IRQHandler(void)
{   TPM1_DriverIRQHandler();
}

WEAK void LPI2C0_IRQHandler(void)
{   LPI2C0_DriverIRQHandler();
}

WEAK void LPI2C1_IRQHandler(void)
{   LPI2C1_DriverIRQHandler();
}

